app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "science"], ["room_number", 3], ["created_at", "2020-10-14 18:37:02.363127"], ["updated_at", "2020-10-14 18:37:02.363127"]]
---
    def create
        @school_class = SchoolClass.new(school_class_params)
        @school_class.save